## Data Wrangling: Clean, Transform, Merge, Reshape

In [1]:
import pandas as pd

## Combining and merging data sets

### Database-style DataFrame merges

In [8]:
df1 = pd.DataFrame({'data1': range(5,12), 'key': list('bbacaad')})
df2 = pd.DataFrame({'data2': range(56,59), 'key': list('abd')})

In [ ]:
df3 = pd.DataFrame({'data2': range(56,61), 'key': list(abdbd)})

In [9]:
df1

   data1 key
0      5   b
1      6   b
2      7   a
3      8   c
4      9   a
5     10   a
6     11   d

In [10]:
df2

   data2 key
0     56   a
1     57   b
2     58   d

In [11]:
pd.merge(df1, df2)

   data1 key  data2
0      5   b     57
1      6   b     57
2      7   a     56
3      9   a     56
4     10   a     56
5     11   d     58

By default, .merge() performs an [inner join](https://www.w3schools.com/sql/sql_join.asp) between the DataFrames, using the common columns as keys.

In [12]:
df3 = pd.DataFrame({'data2': range(56,61), 'key': list('abdbd')})

In [13]:
df1.merge(df3)

   data1 key  data2
0      5   b     57
1      5   b     59
2      6   b     57
3      6   b     59
4      7   a     56
5      9   a     56
6     10   a     56
7     11   d     58
8     11   d     60

In [14]:
df4 = pd.DataFrame({'data2': range(56,61), 'rkey': list('abdbd')})

In [15]:
df1.merge(df4) #por la columna que se llama rkey

MergeError: No common columns to perform merge on. Merge options: left_on=None, right_on=None, left_index=False, right_index=False

In [16]:
df1.merge(df4, left_on='key', right_on='rkey') #por defecto hace inner

   data1 key  data2 rkey
0      5   b     57    b
1      5   b     59    b
2      6   b     57    b
3      6   b     59    b
4      7   a     56    a
5      9   a     56    a
6     10   a     56    a
7     11   d     58    d
8     11   d     60    d

In [17]:
df1.merge(df4, left_on='key', right_on='rkey', how='outer') #te indica todo

   data1 key  data2 rkey
0      5   b   57.0    b
1      5   b   59.0    b
2      6   b   57.0    b
3      6   b   59.0    b
4      7   a   56.0    a
5      9   a   56.0    a
6     10   a   56.0    a
7      8   c    NaN  NaN
8     11   d   58.0    d
9     11   d   60.0    d

That means that it returns the cartesian product of the elements with common keys: if there are duplicates, it will return all the possible combinations:

If the columns to join on don't have the same name, or we want to join on the index of the DataFrames, we'll need to specify that.

If there are two columns with the same name that we do not join on, both will get transferred to the resulting DataFrame with a suffix. We can customize these suffixes.

In [22]:
df1.merge(df2, left_on='data1', right_on='data2', how='outer')#quiero hacer el merge por data no por key
# como tiene dos columnas que se llaman igual por defecto llama key_x y key_y

   data1 key_x  data2 key_y
0    5.0     b    NaN   NaN
1    6.0     b    NaN   NaN
2    7.0     a    NaN   NaN
3    8.0     c    NaN   NaN
4    9.0     a    NaN   NaN
5   10.0     a    NaN   NaN
6   11.0     d    NaN   NaN
7    NaN   NaN   56.0     a
8    NaN   NaN   57.0     b
9    NaN   NaN   58.0     d

In [24]:
df1.merge(df2, left_on='data1', right_on='data2', how='outer', suffixes=('_costumer', '_order'))

# le puedo llamar a la x e y como quiera.

   data1 key_costumer  data2 key_order
0    5.0            b    NaN       NaN
1    6.0            b    NaN       NaN
2    7.0            a    NaN       NaN
3    8.0            c    NaN       NaN
4    9.0            a    NaN       NaN
5   10.0            a    NaN       NaN
6   11.0            d    NaN       NaN
7    NaN          NaN   56.0         a
8    NaN          NaN   57.0         b
9    NaN          NaN   58.0         d

### Merging on index

In [27]:
# hacer merge por indice

df4.index = range(5,10)
df4

   data2 rkey
5     56    a
6     57    b
7     58    d
8     59    b
9     60    d

In [28]:
df1

   data1 key
0      5   b
1      6   b
2      7   a
3      8   c
4      9   a
5     10   a
6     11   d

In [29]:
df1.merge(df4, left_on='data1', right_index=True) #el que esta izquierda es df1 y la derecha df4
#indice 0 dentro 5 pues busco el indice 5 de data2 y devuelve el numero

   data1 key  data2 rkey
0      5   b     56    a
1      6   b     57    b
2      7   a     58    d
3      8   c     59    b
4      9   a     60    d

### Concatenating along an axis

In [32]:
df_concata = pd.concat([df1, df2], sort=True)
df_concata

   data1  data2 key
0    5.0    NaN   b
1    6.0    NaN   b
2    7.0    NaN   a
3    8.0    NaN   c
4    9.0    NaN   a
5   10.0    NaN   a
6   11.0    NaN   d
0    NaN   56.0   a
1    NaN   57.0   b
2    NaN   58.0   d

In [37]:
df_concata.loc[0]

   data1  data2 key
0    5.0    NaN   b
0    NaN   56.0   a

In [36]:
df_concata.reset_index()

   index  data1  data2 key
0      0    5.0    NaN   b
1      1    6.0    NaN   b
2      2    7.0    NaN   a
3      3    8.0    NaN   c
4      4    9.0    NaN   a
5      5   10.0    NaN   a
6      6   11.0    NaN   d
7      0    NaN   56.0   a
8      1    NaN   57.0   b
9      2    NaN   58.0   d

In [35]:
df_concata.reset_index(drop=True)

   data1  data2 key
0    5.0    NaN   b
1    6.0    NaN   b
2    7.0    NaN   a
3    8.0    NaN   c
4    9.0    NaN   a
5   10.0    NaN   a
6   11.0    NaN   d
7    NaN   56.0   a
8    NaN   57.0   b
9    NaN   58.0   d

#### Digression

Attention! Be careful not to reassign to reserved words or functions- you will overwrite the variable.

In [38]:
pd.concat = [df1, df2]

In [39]:
pd.concat([df1, df2]) #lista de los datasframes

TypeError: 'list' object is not callable

You can delete the overwritten variable, but you won't get back the original value. If it is an object or function from a module, you'll need to reload() the module, since Python doesn't load again an already imported module if you try to import it. reload() is useful also when you are actively developing your own module and want to load the latest definition of a function into memory.

In [41]:
del(pd.concat)
pd.concat([df1, df2])

AttributeError: concat

In [42]:
import pandas as pd
pd.concat([df1, df2]) #te has cargado el metodo de pandas

AttributeError: module 'pandas' has no attribute 'concat'

In [48]:
from importlib import reload #esto hace que te machaque
reload(pd)

In [50]:
import pandas as pd
pd.concant([df1,df2])

AttributeError: module 'pandas' has no attribute 'concant'

## Data transformation

### Removing duplicates

In [ ]:
DARLE UN REPASO

In [51]:
df1['key']

0    b
1    b
2    a
3    c
4    a
5    a
6    d
Name: key, dtype: object

In [53]:
df1['key'].duplicated() #b lo he visto antes no, b lo he visto antes si es duplicado

0    False
1     True
2    False
3    False
4     True
5     True
6    False
Name: key, dtype: bool

In [54]:
df1['key'].drop_duplicates() #no te modifica para modifcar utilizando el inplace

0    b
2    a
3    c
6    d
Name: key, dtype: object

In [55]:
df1.drop_duplicates(subset='key') #

   data1 key
0      5   b
2      7   a
3      8   c
6     11   d

In [57]:
df1['key2'] = list('aaadccd')
df1

   data1 key key2
0      5   b    a
1      6   b    a
2      7   a    a
3      8   c    d
4      9   a    c
5     10   a    c
6     11   d    d

In [58]:
df1[['key', 'key2']].drop_duplicates()

  key key2
0   b    a
2   a    a
3   c    d
4   a    c
6   d    d

In [59]:
df1

   data1 key key2
0      5   b    a
1      6   b    a
2      7   a    a
3      8   c    d
4      9   a    c
5     10   a    c
6     11   d    d

In [60]:
df1.drop_duplicates(subset=['key', 'key2']) #elima cuando se repite

   data1 key key2
0      5   b    a
2      7   a    a
3      8   c    d
4      9   a    c
6     11   d    d

In [61]:
df1.drop_duplicates(subset=['key', 'key2'], keep='last') #coge el último

   data1 key key2
1      6   b    a
2      7   a    a
3      8   c    d
5     10   a    c
6     11   d    d

### Renaming axis indexes

In [62]:
df1.index = list('jklmnop')
df1

   data1 key key2
j      5   b    a
k      6   b    a
l      7   a    a
m      8   c    d
n      9   a    c
o     10   a    c
p     11   d    d

### Discretization and binning

In [63]:
import numpy as np

In [64]:
np.random.seed(42) #siempre pongo la semilla

In [66]:
ages = pd.Series(np.random.randint(9,99, 50)) #quiero que vaya de 9 al 99 y coge 50 numeros
ages

0     22
1     17
2     98
3     61
4     10
5     92
6     68
7     79
8     52
9     16
10    55
11    43
12    86
13    89
14    44
15    58
16    12
17    10
18    14
19    62
20    12
21    62
22    71
23    26
24    98
25    52
26    42
27    82
28    70
29    22
30    56
31    23
32    80
33    86
34    95
35    70
36    48
37    93
38    88
39    90
40    61
41    32
42    34
43    97
44    68
45    49
46    37
47    23
48    53
49    73
dtype: int32

In [70]:
limits = [18, 30, 45, 65, 85, 100]

pd.cut(ages, limits) # hacer bins

0      (18, 30]
1           NaN
2     (85, 100]
3      (45, 65]
4           NaN
5     (85, 100]
6      (65, 85]
7      (65, 85]
8      (45, 65]
9           NaN
10     (45, 65]
11     (30, 45]
12    (85, 100]
13    (85, 100]
14     (30, 45]
15     (45, 65]
16          NaN
17          NaN
18          NaN
19     (45, 65]
20          NaN
21     (45, 65]
22     (65, 85]
23     (18, 30]
24    (85, 100]
25     (45, 65]
26     (30, 45]
27     (65, 85]
28     (65, 85]
29     (18, 30]
30     (45, 65]
31     (18, 30]
32     (65, 85]
33    (85, 100]
34    (85, 100]
35     (65, 85]
36     (45, 65]
37    (85, 100]
38    (85, 100]
39    (85, 100]
40     (45, 65]
41     (30, 45]
42     (30, 45]
43    (85, 100]
44     (65, 85]
45     (45, 65]
46     (30, 45]
47     (18, 30]
48     (45, 65]
49     (65, 85]
dtype: category
Categories (5, interval[int64]): [(18, 30] < (30, 45] < (45, 65] < (65, 85] < (85, 100]]

## String manipulation

### String object methods

In [71]:
np.random.choice(['pluton', 'jupiter', 'earth the true planet', 'milky way', 'ISS'], 60)

array(['pluton', 'pluton', 'pluton', 'milky way', 'earth the true planet',
       'earth the true planet', 'pluton', 'earth the true planet',
       'earth the true planet', 'pluton', 'earth the true planet', 'ISS',
       'jupiter', 'jupiter', 'pluton', 'milky way', 'pluton', 'milky way',
       'jupiter', 'pluton', 'ISS', 'earth the true planet', 'milky way',
       'earth the true planet', 'earth the true planet', 'pluton',
       'earth the true planet', 'ISS', 'earth the true planet', 'pluton',
       'ISS', 'jupiter', 'earth the true planet', 'pluton', 'jupiter',
       'jupiter', 'milky way', 'ISS', 'earth the true planet', 'pluton',
       'milky way', 'ISS', 'milky way', 'ISS', 'ISS',
       'earth the true planet', 'ISS', 'milky way', 'ISS',
       'earth the true planet', 'earth the true planet', 'milky way',
       'jupiter', 'jupiter', 'ISS', 'pluton', 'ISS', 'milky way',
       'milky way', 'milky way'], dtype='<U21')

In [72]:
cosmos_df = pd.Series(np.random.choice(['pluton', 'jupiter', 'earth the true planet', 'milky way', 'ISS'], 60))

In [73]:
cosmos_df

0                 milky way
1                 milky way
2     earth the true planet
3                   jupiter
4                 milky way
5                    pluton
6                    pluton
7                    pluton
8                    pluton
9     earth the true planet
10                   pluton
11                milky way
12                      ISS
13                   pluton
14    earth the true planet
15    earth the true planet
16                   pluton
17                      ISS
18                   pluton
19    earth the true planet
20                  jupiter
21                milky way
22    earth the true planet
23                   pluton
24                milky way
25                   pluton
26                   pluton
27                  jupiter
28                milky way
29                milky way
30                  jupiter
31    earth the true planet
32                   pluton
33                      ISS
34                   pluton
35                   pluton
36    earth the true planet
37                   pluton
38                  jupiter
39                  jupiter
40                milky way
41                      ISS
42                   pluton
43                   pluton
44    earth the true planet
45                  jupiter
46                      ISS
47                milky way
48                  jupiter
49                milky way
50    earth the true planet
51    earth the true planet
52                   pluton
53                      ISS
54                milky way
55                  jupiter
56    earth the true planet
57                   pluton
58                   pluton
59                milky way
dtype: object

In [74]:
cosmos_df.upper()

AttributeError: 'Series' object has no attribute 'upper'

In [78]:
 ###Funcion vectorizada

In [75]:
cosmos_df.str.upper()

0                 MILKY WAY
1                 MILKY WAY
2     EARTH THE TRUE PLANET
3                   JUPITER
4                 MILKY WAY
5                    PLUTON
6                    PLUTON
7                    PLUTON
8                    PLUTON
9     EARTH THE TRUE PLANET
10                   PLUTON
11                MILKY WAY
12                      ISS
13                   PLUTON
14    EARTH THE TRUE PLANET
15    EARTH THE TRUE PLANET
16                   PLUTON
17                      ISS
18                   PLUTON
19    EARTH THE TRUE PLANET
20                  JUPITER
21                MILKY WAY
22    EARTH THE TRUE PLANET
23                   PLUTON
24                MILKY WAY
25                   PLUTON
26                   PLUTON
27                  JUPITER
28                MILKY WAY
29                MILKY WAY
30                  JUPITER
31    EARTH THE TRUE PLANET
32                   PLUTON
33                      ISS
34                   PLUTON
35                   PLUTON
36    EARTH THE TRUE PLANET
37                   PLUTON
38                  JUPITER
39                  JUPITER
40                MILKY WAY
41                      ISS
42                   PLUTON
43                   PLUTON
44    EARTH THE TRUE PLANET
45                  JUPITER
46                      ISS
47                MILKY WAY
48                  JUPITER
49                MILKY WAY
50    EARTH THE TRUE PLANET
51    EARTH THE TRUE PLANET
52                   PLUTON
53                      ISS
54                MILKY WAY
55                  JUPITER
56    EARTH THE TRUE PLANET
57                   PLUTON
58                   PLUTON
59                MILKY WAY
dtype: object

In [76]:
cosmos_df.str.lower()

0                 milky way
1                 milky way
2     earth the true planet
3                   jupiter
4                 milky way
5                    pluton
6                    pluton
7                    pluton
8                    pluton
9     earth the true planet
10                   pluton
11                milky way
12                      iss
13                   pluton
14    earth the true planet
15    earth the true planet
16                   pluton
17                      iss
18                   pluton
19    earth the true planet
20                  jupiter
21                milky way
22    earth the true planet
23                   pluton
24                milky way
25                   pluton
26                   pluton
27                  jupiter
28                milky way
29                milky way
30                  jupiter
31    earth the true planet
32                   pluton
33                      iss
34                   pluton
35                   pluton
36    earth the true planet
37                   pluton
38                  jupiter
39                  jupiter
40                milky way
41                      iss
42                   pluton
43                   pluton
44    earth the true planet
45                  jupiter
46                      iss
47                milky way
48                  jupiter
49                milky way
50    earth the true planet
51    earth the true planet
52                   pluton
53                      iss
54                milky way
55                  jupiter
56    earth the true planet
57                   pluton
58                   pluton
59                milky way
dtype: object

In [77]:
cosmos_df.str.len()#mirar la longitud del string. se llama funcion vectorizada

0      9
1      9
2     21
3      7
4      9
5      6
6      6
7      6
8      6
9     21
10     6
11     9
12     3
13     6
14    21
15    21
16     6
17     3
18     6
19    21
20     7
21     9
22    21
23     6
24     9
25     6
26     6
27     7
28     9
29     9
30     7
31    21
32     6
33     3
34     6
35     6
36    21
37     6
38     7
39     7
40     9
41     3
42     6
43     6
44    21
45     7
46     3
47     9
48     7
49     9
50    21
51    21
52     6
53     3
54     9
55     7
56    21
57     6
58     6
59     9
dtype: int64

In [81]:
df_bike_crashes = pd.read_csv("../AccidentesBicicletas_2019.csv", encoding = 'latin1', sep=';')
df_bike_crashes.head()

,Nº EXPEDIENTE,FECHA,HORA,CALLE,NÚMERO,DISTRITO,TIPO ACCIDENTE,ESTADO METEREOLÓGICO,TIPO VEHÍCULO,TIPO PERSONA,RANGO DE EDAD,SEXO,LESIVIDAD*
0,2019S000659,01/01/2019,14:00,CALL. CASTELLO / CALL. DON RAMON DE LA CRUZ,-,SALAMANCA,Alcance,Despejado,Bicicleta,Conductor,DE 25 A 29 AÑOS,Hombre,1.0
1,2019S000036,02/01/2019,20:45,AVDA. GRAN VIA DE HORTALEZA / GTA. LUIS ROSALES,-,HORTALEZA,Colisión fronto-lateral,Despejado,Bicicleta,Conductor,DE 70 A 74 AÑOS,Hombre,3.0
2,2019S000133,03/01/2019,14:30,CALL. FELIPE ALVAREZ,10,VILLA DE VALLECAS,Alcance,Se desconoce,Bicicleta,Conductor,DE 15 A 17 AÑOS,Hombre,7.0
3,2019S000132,03/01/2019,12:45,AVDA. SANTA EUGENIA / CALL. REAL DE ARGANDA,-,VILLA DE VALLECAS,Alcance,Despejado,Bicicleta,Conductor,DE 18 A 20 AÑOS,Hombre,7.0
4,2019S000132,03/01/2019,12:45,AVDA. SANTA EUGENIA / CALL. REAL DE ARGANDA,-,VILLA DE VALLECAS,Alcance,Despejado,Bicicleta,Conductor,DE 21 A 24 AÑOS,Hombre,14.0

In [82]:
df_bike_crashes.columns #cambiar los nombres de las columnas

Index(['Nº  EXPEDIENTE', 'FECHA', 'HORA', 'CALLE', 'NÚMERO', 'DISTRITO',
       'TIPO ACCIDENTE', 'ESTADO METEREOLÓGICO', 'TIPO VEHÍCULO',
       'TIPO PERSONA', 'RANGO DE EDAD', 'SEXO', 'LESIVIDAD*'],
      dtype='object')

In [84]:
pd.Series(df_bike_crashes.columns) #serie en comun con los indices que son inmutables

0           Nº  EXPEDIENTE
1                    FECHA
2                     HORA
3                    CALLE
4                   NÚMERO
5                 DISTRITO
6           TIPO ACCIDENTE
7     ESTADO METEREOLÓGICO
8            TIPO VEHÍCULO
9             TIPO PERSONA
10           RANGO DE EDAD
11                    SEXO
12              LESIVIDAD*
dtype: object

In [85]:
change = pd.Series(df_bike_crashes.columns)
change

0           Nº  EXPEDIENTE
1                    FECHA
2                     HORA
3                    CALLE
4                   NÚMERO
5                 DISTRITO
6           TIPO ACCIDENTE
7     ESTADO METEREOLÓGICO
8            TIPO VEHÍCULO
9             TIPO PERSONA
10           RANGO DE EDAD
11                    SEXO
12              LESIVIDAD*
dtype: object

In [88]:
lower = change.str.lower()
lower

0           nº  expediente
1                    fecha
2                     hora
3                    calle
4                   número
5                 distrito
6           tipo accidente
7     estado metereológico
8            tipo vehículo
9             tipo persona
10           rango de edad
11                    sexo
12              lesividad*
dtype: object

In [98]:
spaces = lower.str.replace(" ", "_")
spaces

0           nº__expediente
1                    fecha
2                     hora
3                    calle
4                   número
5                 distrito
6           tipo_accidente
7     estado_metereológico
8            tipo_vehículo
9             tipo_persona
10           rango_de_edad
11                    sexo
12              lesividad*
dtype: object

In [121]:
diff = 'º,´,*' #optcion meterlo en una lista

In [122]:
special = spaces.str.replace("º"," ").astype(str)
special

0           n __expediente
1                    fecha
2                     hora
3                    calle
4                   número
5                 distrito
6           tipo_accidente
7     estado_metereológico
8            tipo_vehículo
9             tipo_persona
10           rango_de_edad
11                    sexo
12              lesividad*
dtype: object

In [129]:
dele = spaces.str.translate({ord(c):"" for c in "!@#$%^&*()[]{};:,./<>?\|`~-=+º"})
dele

0            n__expediente
1                    fecha
2                     hora
3                    calle
4                   número
5                 distrito
6           tipo_accidente
7     estado_metereológico
8            tipo_vehículo
9             tipo_persona
10           rango_de_edad
11                    sexo
12               lesividad
dtype: object

In [130]:
#PROFESOR
index_series = pd.Series(df_bike_crashes.columns)
index_series

0           Nº  EXPEDIENTE
1                    FECHA
2                     HORA
3                    CALLE
4                   NÚMERO
5                 DISTRITO
6           TIPO ACCIDENTE
7     ESTADO METEREOLÓGICO
8            TIPO VEHÍCULO
9             TIPO PERSONA
10           RANGO DE EDAD
11                    SEXO
12              LESIVIDAD*
dtype: object

In [138]:
rr = index_series.str.split().apply(lambda x: x[-1]).str.replace('\W','').str.lower()\
            .str.replace('ú','u').str.replace('ó','o').str.replace('í','i')
rr

0        expediente
1             fecha
2              hora
3             calle
4            numero
5          distrito
6         accidente
7     metereologico
8          vehiculo
9           persona
10             edad
11             sexo
12        lesividad
dtype: object

### Vectorized string functions in pandas

[Vectorized string functions in pandas](https://pandas.pydata.org/pandas-docs/stable/text.html) are grouped within the .str attribute of Series and Indexes. They have the same names as the regular Python string functions, but work on Series of strings.